Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.52/edc/ATSAMR34J16B.PIC
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x41000184" edc:cname="PSTATUSCLR4" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Curren Bank clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x41000104" edc:cname="PSTATUSCLR0" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Curren Bank clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x41000185" edc:cname="PSTATUSSET4" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="ww-w-w-w" edc:addr="0x41000105" edc:cname="PSTATUSSET0" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rr-r-r-r" edc:addr="0x41000106" edc:cname="PSTATUS0" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rr-r-r-r" edc:addr="0x41000186" edc:cname="PSTATUS4" edc:impl="0xD5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:desc="Data Toggle" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn" edc:addr="0x41000107" edc:cname="PINTFLAG0" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:desc="Error Flow Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Pipe Error Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:desc="Transmit  Setup Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="Stall Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn" edc:addr="0x41000187" edc:cname="PINTFLAG4" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:desc="Error Flow Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Pipe Error Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:desc="Transmit  Setup Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="Stall Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
